#### Terraform Format 🖌 `success`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.scp_manager.aws_organizations_policy.limit_regions: Refreshing state... [id=p-02s3te0u]
data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0]: Reading...
module.scp_manager.aws_organizations_policy.nuke_supported_services: Refreshing state... [id=p-7pd0szg9]
module.scp_manager.aws_organizations_policy.cost_avoidance[0]: Refreshing state... [id=p-ozmh7axs]
module.scp_manager.aws_organizations_policy_attachment.nuke_supported_services: Refreshing state... [id=ou-2laj-4dyae1oa:p-7pd0szg9]
module.scp_manager.aws_organizations_policy_attachment.cost_avoidance[0]: Refreshing state... [id=ou-2laj-sre4rnjs:p-ozmh7axs]
module.scp_manager.aws_organizations_policy_attachment.limit_regions: Refreshing state... [id=ou-2laj-4dyae1oa:p-02s3te0u]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.budgets[0].aws_sns_topic.budget_alerts[0] will be created
  + resource "aws_sns_topic" "budget_alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + display_name                = "Innovation Sandbox Budget Alerts"
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "ndx-sandbox-budget-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + signature_version           = (known after apply)
      + tags                        = {
          + "Component" = "Budget-Guardrails"
          + "Purpose"   = "Budget-Alerts"
        }
      + tags_all                    = {
          + "Component"   = "Budget-Guardrails"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Purpose"     = "Budget-Alerts"
          + "Repository"  = "terraform-scp-overrides"
        }
      + tracing_config              = (known after apply)
    }

  # module.budgets[0].aws_sns_topic_policy.budget_alerts[0] will be created
  + resource "aws_sns_topic_policy" "budget_alerts" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
      + region = "us-east-1"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - budget_limits_summary    = {
      - automated_actions = "Disabled"
      - daily_total       = "${var.daily_budget_limit}/day"
      - monthly_total     = "${var.monthly_budget_limit}/month"
      - service_budgets   = {
          - bedrock       = "${var.bedrock_daily_limit}/day"
          - data_transfer = "${var.data_transfer_daily_limit}/day"
          - dynamodb      = "${var.dynamodb_daily_limit}/day"
          - ec2           = "${var.ec2_daily_limit}/day"
          - lambda        = "${var.lambda_daily_limit}/day"
          - rds           = "${var.rds_daily_limit}/day"
        }
    } -> null
  + budget_sns_topic_arn     = (known after apply)
  - cost_defense_summary     = {
      - layer_1_scps    = {
          - controls = [
              - "Instance type allowlist",
              - "GPU/accelerated instances blocked",
              - "EBS volume type/size limits",
              - "RDS instance class/Multi-AZ/IOPS limits",
              - "ElastiCache node type limits",
              - "Auto Scaling Group size limits",
              - "EKS nodegroup size limits",
              - "Expensive services blocked",
            ]
          - status   = "Always enabled"
        }
      - layer_2_quotas  = {
          - max_ebs_storage   = "2 TiB"
          - max_ec2_vcpus     = "64"
          - max_rds_instances = "5"
          - status            = "Enabled"
        }
      - layer_3_budgets = {
          - automated_actions = "Disabled"
          - daily_limit       = "${var.daily_budget_limit}/day"
          - monthly_limit     = "${var.monthly_budget_limit}/month"
          - status            = "Enabled"
        }
    } -> null
  - estimated_max_daily_cost = "$159.48/day (estimated)" -> null
  ~ scp_policy_ids           = {
      ~ cost_avoidance          = null -> "p-ozmh7axs"
        # (2 unchanged attributes hidden)
    }
  - service_quotas_summary   = {
      - cloudwatch  = {
          - log_group_count = 50
        }
      - dynamodb    = {
          - table_count = 50
        }
      - ebs         = {
          - gp2_storage_tib = 1
          - gp3_storage_tib = 1
          - io1_iops        = 0
          - io2_iops        = 0
          - snapshot_count  = 100
        }
      - ec2         = {
          - gpu_vcpus       = 0
          - inf_vcpus       = 0
          - on_demand_vcpus = 64
          - p_vcpus         = 0
          - spot_vcpus      = 64
        }
      - eks         = {
          - cluster_count = 2
        }
      - elasticache = {
          - node_count = 10
        }
      - elb         = {
          - alb_count = 5
          - nlb_count = 5
        }
      - kinesis     = {
          - shard_count = 0
        }
      - lambda      = {
          - concurrent_executions = 100
        }
      - rds         = {
          - instance_count           = 5
          - read_replicas_per_source = 0
          - total_storage_gb         = 500
        }
      - vpc         = {
          - elastic_ips         = 5
          - nat_gateways_per_az = 2
          - vpc_count           = 5
        }
    } -> null

Error: listing Organizations Accounts for parent (ou-2laj-sre4rnjs) and descendants: operation error Organizations: ListAccountsForParent, https response error StatusCode: 400, RequestID: c364e81b-cb27-4b56-933c-1923c3cf2c5e, AccessDeniedException: You don't have permissions to access this resource.

  with data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0],
  on main.tf line 64, in data "aws_organizations_organizational_unit_descendant_accounts" "sandbox_pool":
  64: data "aws_organizations_organizational_unit_descendant_accounts" "sandbox_pool" {

::error::Terraform exited with code 1.
```

</details>

*Pushed by: @gjarzebak95, Action: `pull_request`*